from core.models import Subject

subjects_to_add = [
    "اللغة العربية",
    "اللغة الإنجليزية",
    "اللغة الفرنسية",
    "اللغة الألمانية",
    "اللغة الإيطالية",
    "الرياضيات",
    "العلوم",
    "الدراسات الاجتماعية",
    "الفيزياء",
    "الكيمياء",
    "الأحياء",
    "الجيولوجيا وعلوم البيئة",
    "التاريخ",
    "الجغرافيا",
    "الفلسفة والمنطق",
    "علم النفس والاجتماع",
    "التربية الدينية",
    "التربية الوطنية",
    "الاقتصاد والإحصاء",
    "الحاسب الآلي"
]

added_count = 0
for sub_name in subjects_to_add:
    obj, created = Subject.objects.get_or_create(name=sub_name)
    if created:
        added_count += 1

print(f"تمت إضافة {added_count} مادة جديدة بنجاح!")
